Tekla Open API Reference for Tekla Structures 2025
RebarSpacing.IsExactFlexibleType Method
 Gets whether the spacing is an exact type with flexible space(s).
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool IsExactFlexibleType(
	RebarSpacing.SpacingType type
)
Public Shared Function IsExactFlexibleType (
	type As RebarSpacing.SpacingType
) As Boolean
Parameters
type
Type: Tekla.Structures.Model.RebarSpacing.SpacingType
The spacing type.
Return Value
Type: Boolean
True if it is an exact flexible type spacing.
See Also
Reference
RebarSpacing Class
Tekla.Structures.Model Namespace